/**
 * Внутрішній клас Luke для обчислення значень чисел Люка.
 */
class Luke {
    // Порядковий номер числа Люка
    int num;
    // Значення числа Люка
    long value;

    //Конструктор для ініціалізації числа Люка за його порядковим номером і значенням.
    Luke(int num, long value) {
        this.num = num;
        this.value = value;
    }

    //Метод для отримання квадрата значення числа Люка.
    long getvalue2() {
        return value * value;
    }

    //Метод для отримання значення числа Люка.
    long getvalue() {
        return value;
    }
    //Метод для отримання порядкового номера числа Люка.
    int getnum(){
        return num;
    }
}